var local_database = [
    {
        date: "Sep 18 2016",
        title: "机器人瓦力",
        imgSrc: "/images/post/wali.jpg",
        avatar: "/images/avatar/1.png",
        content: "故事讲述了地球上的清扫型机器人瓦力偶遇并爱上了机器人伊娃后，追随她进入太空历险的一系列故事",
        reading: "112",
        collection: "96",
        headImgSrc: "/images/post/wali.jpg",
        author: "林白衣",
        dateTime: "24小时前",
        detail: "公元2700年，地球早就被人类祸害成了一个巨大的垃圾场，已经到了无法居住的地步，人类只能大举迁移到别的星球，然后委托一家机器人垃圾清理公司善后，直至地球的环境系统重新达到生态平衡。在人类离开之后，垃圾清理公司将机器人瓦力成批地输送到地球，并给他们安装了惟一的指令——垃圾分装，然而随着时间的推移，机器人一个接一个地坏掉，最后只剩下惟一的一个，继续在这个似乎已经被遗忘了的角落，勤勤恳恳地在垃圾堆中忙碌着，转眼就过去了几百年的时间，寂寞与孤独变成了围绕着他的永恒的主题。然而，一艘突然而至的宇宙飞船打破了这里的平静，它还带来了专职搜索任务的机器人伊娃，当瓦力经历了几百年的孤独，终于见到了另一个机器人时，他觉得自己好像爱上她了，伊娃在经过了精确的计算之后，数据显示出，看起来漫不经心的瓦力很可能是关乎着地球未来的关键所在，她通过宇宙飞船将自己的发现报告给人类，收到了将瓦力带离地球的指令——人类正想尽办法重回地球，所以他们不会放弃任何可能的机会。于是瓦力追随着伊娃，展开了一次穿越整个银河系、最令人兴奋、也是最具有想象力的奇幻旅程",
        postId: 0,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100003507bR0gDKBm.m4a?fromtag=38",
            title: "夜夜夜夜-齐秦",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001TEc6V0kjpVC.jpg?max_age=2592000"
        }
    },
    {
        title: "比利·林恩的中场故事",
        content: "一 “李安是一位绝不会重复自己的导演，本片将极富原创性李安众所瞩目的新片《比利林恩漫长的中场休息》，正式更名《半场无战事》。",
        imgSrc: "/images/post/bl.png",
        reading: 62,
        detail: "一 “李安是一位绝不会重复自己的导演，本片将极富原创性”李安众所瞩目的新片《比利林恩漫长的中场休息》，正式更名《半场无战事》。预告片首次曝光后，被视作是明年奥斯卡种子选手。该片根据同名畅销书改编。原著小说荣获美国国家图书奖。也被BBC评为21世纪最伟大的12本英文小说之一。影片讲述一位19岁德州男孩的比利·林恩入伍参加伊战，在一次交火中他大难不死，意外与战友成为大众的关注焦点，并被塑造成英雄。之后他们返回国内，在橄榄球赛中场休息时授勋。这名战争英雄却面临前所未有的心灵煎熬……李安为什么选中这部电影来拍？因为李安想要挑战前所未有的技术难题：以120帧每秒的速度、4K、3D技术全面结合，来掀起一场电影视觉革命。什么意思？所谓“电影是24格每秒的谎言”，其中的24格，就是帧数。",
        collection: 92,
        dateTime: "24小时前",
        headImgSrc: "/images/post/bl.png",
        author: "迷的城",
        date: "Nov 20 2016",
        avatar: "/images/avatar/1.png",
        postId: 1,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100003GdCmG4NkEOR.m4a?fromtag=38",
            title: "鬼迷心窍-李宗盛",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000002xOmp62kqSic.jpg?max_age=2592000"
        }
    },
    {
        //按住alt + shift + F 可以格式化代码样式
        title: "教父",
        content: "该片改编自马里奥·普佐的同名小说，讲述了以维托·唐·科莱昂为首的黑帮家族的发展过程以及科莱昂的小儿子迈克如何接任父亲成为黑帮首领的故事。1973年该片获得第45届奥斯卡奖最佳电影、最佳男主角、最佳改编剧本奖。2007年被美国电影协会选为“百年百佳影片第二位”",
        detail: "1945年夏天，美国本部黑手党科莱昂家族首领，教父维托·唐·科莱昂为小女儿康妮举行了盛大的婚礼。维托·唐·科莱昂有三个儿子，好色的长子逊尼，懦弱的次子弗雷德和从二战战场回来的小儿子迈克。其中逊尼是教父的得力助手；而迈克虽然精明能干，却对家族的事业没什么兴趣。维托·唐·科莱昂是黑手党首领，常干违法的勾当。但同时他也许多弱小平民的保护神，深得人们爱戴。他还有一个准则，就是决不贩毒害人。为此他绝了毒枭素洛佐的要求，并因此激化了与纽约其它几个黑手党家族的矛盾。圣诞前夕，素洛佐劫持了教父的教子汤姆，并派人暗杀教父。教父中枪入院。素洛佐要汤姆设法使逊尼同意毒品买卖，重新谈判。逊尼有勇无谋，他发誓报仇，却无计可施。　迈克去医院探望父亲，他发现保镖已被收买，而警方亦和素洛佐串通一气。各家族间的火并一触即发。迈克制定了一个计策诱使素洛佐和警长前来谈判。在一家小餐馆内，迈克用事先藏在厕所内的手枪击毙了素洛佐和警长。　迈克逃到了西西里，在那里他娶了美丽的阿波萝妮亚为妻，过着田园诗般的生活。而此时，纽约各个黑手党家族间的仇杀却越来越激烈。逊尼也被康妮的丈夫卡洛出卖，被人打得千疮百孔。教父伤愈复出，安排各家族间的和解。听到噩耗的迈克也受到了袭击。被收买的保镖法布里奇奥在迈克的车上装了炸弹。迈克虽幸免于难，却痛失爱妻。",
        imgSrc: "/images/post/father.jpg",
        headImgSrc: "/images/post/father.jpg",
        reading: 62,
        collection: 92,
        author: "知乎",
        date: "Nov 12 2016",
        dateTime: "三天前",
        avatar: "/images/avatar/3.png",
        postId: 2,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38",
            title: "女儿情-万晓利",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000"
        }
    },
    {
        title: "蜘蛛侠",
        content: "该片取材自漫威漫画，是漫威电影宇宙的第十六部电影。讲述了彼得·帕克在超级英雄身份与高中生活之间面临的抉择。该片于2017年7月7日在北美公映，9月8日在中国大陆公映",
        imgSrc: "/images/post/spiderman.jpg",
        reading: 102,
        detail: "在英雄内战机场大战落幕后，彼得·帕克（汤姆·赫兰德饰）在恩师托尼·斯塔克（小罗伯特·唐尼饰）的协助下，试图在一名普通高中生和打击犯罪的超级英雄蜘蛛侠间保持平衡，但反派秃鹫（迈克尔·基顿饰）的崛起让人们面临新的威胁。钢铁侠作为蜘蛛侠的导师再次出现，做为引导他踏上英雄之路的关键人物，确保他在未来有资格成为复仇者联盟的一分子",
        collection: 92,
        dateTime: "24小时前",
        headImgSrc: "/images/post/spiderman.jpg",
        author: "猫是猫的猫",
        date: "Nov 20 2016",
        avatar: "/images/avatar/5.png",
        postId: 3,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100002mWVx72p8Ugp.m4a?fromtag=38",
            title: "恋恋风尘-老狼",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001VaXQX1Z1Imq.jpg?max_age=2592000",
        }
    },
    {
        title: "放牛班的春天",
        content: "讲述的是一位怀才不遇的音乐老师马修来到辅育院，面对的不是普通学生，而是一群被大人放弃的野男孩，马修改变了孩子以及他自己的命运的故事。",
        imgSrc: "/images/post/spring.jpg",
        reading: 102,
        detail: "1919年，全世界的人民刚刚从第一次世界大战的阴霾中走出之时，却在美国的巴尔的摩发生了一件怪事。一个叫本杰明·巴顿（布拉德·皮特饰）的奇异婴儿在降生之后，母亲难产而死，自己被亲生父亲遗弃在街边。因为，这个前所未有的怪胎竟然一出生就是一个古稀老人的模样。幸运的是，一位好心的黑人妇女收养了巴顿这个怪异的婴儿。并在随后的岁月里，带他一起生活教育他成长，尽管本杰明·巴顿老弱的身体和看似即将先于继母辞世的长相常常让他在“同龄”的同学们当中成为被嘲笑的话柄。但老继母的不离不弃，时刻给予着他继续生存下去的理由。终于，本杰明迎来了自己在人世上生存的第11个年头，此时的他看起来也似乎健康年轻一些，但依旧老态龙钟。但巴顿在学校里遇到了彻底改变他一生的第二个女人——当时还仅仅6岁的小姑娘黛茜（凯特·布兰切特饰）她的可爱和纯真彻底征服了“老男人”巴顿的心。而巴顿同样真诚、清澈的心也感动了小黛茜，两人之间的爱慕之心开始萌芽世界著名指挥家皮埃尔·莫昂克重回法国故地出席母亲的葬礼，他的旧友佩皮诺送给他一本陈旧的日记，看着这本当年音乐启蒙老师克莱门特·马修遗下的日记，皮埃尔慢慢细味着老师当年的心境，一幕幕童年的回忆也浮出自己记忆的深潭。克莱门特是一个才华横溢的音乐家，不过在1949年的法国乡村，他没有发展自己才华的机会，最终成为了一间男子寄宿学校的助理教师，名为“池塘底教养院”。这所学校有一个外号叫‘池塘之底’，因为这里的学生大部分都是一些顽皮的儿童。到任后克莱门特发现学校的校长以残暴高压的手段管治这班问题少年，体罚在这里司空见惯，性格沉静的克莱门特尝试用自己的方法改善这种状况，闲时他会创作一些合唱曲，而令他惊奇的是这所寄宿学校竟然没有音乐课，他决定用音乐的方法来打开学生们封闭的心灵。马修开始教学生们如何唱歌，但事情进展得并不顺利，一个最大的麻烦制造者就是皮埃尔·莫昂克，皮埃尔拥有天使的面孔和歌喉却有着令人头疼的调皮的性格，谆谆善诱的克莱门特把皮埃尔的音乐天赋发掘出来，同时他也与皮埃尔的母亲产生了一段微妙感情，但却是一厢情愿。最后因为失火事件被校长解雇，",
        collection: 26,
        dateTime: "24小时前",
        headImgSrc: "/images/post/spring.jpg",
        author: "深白色",
        date: "Nov 20 2016",
        avatar: "../../../images/avatar/3.png",
        postId: 4,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100000Zn0vS4fKKo8.m4a?fromtag=38",
            title: "沉默是金-张国荣",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000003at0mJ2YrR2H.jpg?max_age=2592000"
        }
    },
    {
      title: "本杰明巴顿奇事",
      content: "电影讲述了本杰明·巴顿这个怪人，他违反了大自然的规律，竟以老人形象降生人世，之后越活越年轻倒着成长的奇怪生命轨迹。影片获得了第81届奥斯卡最佳视觉效果、最佳化妆、最佳艺术指导三项大奖，而主演布拉德·皮特和塔拉吉·P·汉森也获得了奥斯卡最佳男主角提名和奥斯卡最佳女配角提名",
      imgSrc: "/images/post/nianqing.jpg",
        reading: 96,
        detail: "1919年，全世界的人民刚刚从第一次世界大战的阴霾中走出之时，却在美国的巴尔的摩发生了一件怪事。一个叫本杰明·巴顿（布拉德·皮特饰）的奇异婴儿在降生之后，母亲难产而死，自己被亲生父亲遗弃在街边。因为，这个前所未有的怪胎竟然一出生就是一个古稀老人的模样。幸运的是，一位好心的黑人妇女收养了巴顿这个怪异的婴儿。并在随后的岁月里，带他一起生活教育他成长，尽管本杰明·巴顿老弱的身体和看似即将先于继母辞世的长相常常让他在“同龄”的同学们当中成为被嘲笑的话柄。但老继母的不离不弃，时刻给予着他继续生存下去的理由。终于，本杰明迎来了自己在人世上生存的第11个年头，此时的他看起来也似乎健康年轻一些，但依旧老态龙钟。但巴顿在学校里遇到了彻底改变他一生的第二个女人——当时还仅仅6岁的小姑娘黛茜（凯特·布兰切特饰）她的可爱和纯真彻底征服了“老男人”巴顿的心。而巴顿同样真诚、清澈的心也感动了小黛茜，两人之间的爱慕之心开始萌芽",
        collection: 26,
        dateTime: "21小时前",
        headImgSrc: "/images/post/nianqing.jpg",
        author: "深白色",
        date: "Nov 20 2016",
        avatar: "../../../images/avatar/5.png",
        postId: 5,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100002I8eGJ28BI17.m4a?fromtag=38",
            title: "朋友-谭咏麟",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004eGsCN3SUheO.jpg?max_age=2592000"
        }
    },
]

module.exports = {
    postList: local_database
}